tap "homebrew/bundle"

brew "coreutils"
brew "gh"
brew "mas"
brew "nvm"
brew "pnpm"
brew "yarn"

cask "1password"
cask "arc"
cask "discord"
cask "docker"
cask "elgato-control-center"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "insomnia"
cask "logi-options-plus"
cask "microsoft-edge"
cask "notion"
cask "obs"
cask "raycast"
cask "visual-studio-code"
cask "warp"

mas "Drafts", id: 1435957248
mas "Keynote", id: 409183694
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835

vscode "alexandernanberg.horizon-theme-vscode"
vscode "apollographql.vscode-apollo"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "haack.warp-companion"
vscode "hridoy.rails-snippets"
vscode "jock.svg"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "orta.vscode-react-native-storybooks"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tinaciousdesign.theme-tinaciousdesign"
vscode "tinkertrain.theme-panda"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
